<template>
  <div>
    <div class="mask" v-show="show"></div>
    <div class="proto-dialog" v-show="show">
      <div class="title">用户服务协议</div>
      <div class="body">
        <section>
          <header>一、特别提示</header>
          <p>
            在此特别提醒您（用户）在注册成为行龙乐器用户之前，请认真阅读本《行龙乐器用户服务协议》（以下简称“协议”），确保您充分理解本协议中各条款。请您审慎阅读并选择接受或不接受本协议。除非您接受本协议所有条款，否则您无权注册、登录或使用本协议所涉服务。您的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。
          </p>
          <p>
            本协议约定行龙乐器与用户之间关于“钢琴租购”服务（以下简称“服务”）的权利义务。“用户”是指注册、登录、使用本服务的个人。本协议可由行龙乐器随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，用户可在本网站中查阅最新版协议条款。在修改协议条款后，如果用户不接受修改后的条款，请立即停止使用行龙乐器提供的服务，用户继续使用行龙提供的服务将被视为接受修改后的协议。

          </p>
        </section>
        <section>
          <header>
            二、账号注册
          </header>
          <p>
            1、用户在使用本服务前需要注册一个“行龙乐器”账号。“行龙乐器”账号应当使用手机号码绑定注册，请用户使用尚未与“行龙乐器”账号绑定的手机号码，以及未被行龙乐器根据本协议封禁的手机号码注册“行龙乐器”账号。行龙乐器可以根据用户需求或产品需要对账号注册和绑定的方式进行变更，而无须事先通知用户。
          </p>
          <p>
            2、如果注册申请者有被行龙乐器封禁的先例或涉嫌虚假注册及滥用他人名义注册，及其他不能得到许可的理由，行龙乐器将拒绝其注册申请
          </p>
          <p>
            3、鉴于“行龙乐器”账号的绑定注册方式，您同意行龙乐器在注册时将允许您的手机号码及手机设备识别码等信息用于注册。 
          </p>
          <p>
            4、在用户注册及使用本服务时，行龙乐器需要搜集能识别用户身份的个人信息以便行龙乐器可以在必要时联系用户，或为用户提供更好的使用体验。行龙乐器搜集的信息包括但不限于用户的姓名、地址；行龙乐器同意对这些信息的使用将受限于第三条用户个人隐私信息保护的约束。
          </p>
        </section>
        <section>
          <header>
            三、账户安全
          </header>
          <p>
            1、用户一旦注册成功，成为行龙乐器的用户，将得到一个用户名和密码，并有权利使用自己的用户名及密码随时登陆行龙乐器
          </p>
          <p>
            2、用户对用户名和密码的安全负全部责任，同时对以其用户名进行的所有活动和事件负全责。
          </p>
          <p>
            3、用户不得以任何形式擅自转让或授权他人使用自己的行龙乐器用户名。
          </p>
          <p>
            4、如果用户泄漏了密码，有可能导致不利的法律后果，因此不管任何原因导致用户的密码安全受到威胁，应该立即和行龙乐器客服人员取得联系，否则后果自负。
          </p>
        </section>
        <section>
          <header>
            四、用户声明与保证
          </header>
          <p>
            1、用户承诺其为具有完全民事行为能力的民事主体，且具有达成交易履行其义务的能力
          </p>
          <p>
            2、用户有义务在注册时提供自己的真实资料，并保证诸如手机号码、姓名、所在地区等内容的有效性及安全性，保证行龙乐器工作人员可以通过上述联系方式与用户取得联系。同时，用户也有义务在相关资料实际变更时及时更新有关注册资料。
          </p>
          <p>
            3、用户通过使用行龙乐器的过程中所制作、上载、复制、发布、传播的任何内容，包括但不限于账号头像、名称、用户说明等注册信息及认证资料，或文字、语音、图片、视频、图文等发送、回复和相关链接页面，以及其他使用账号或本服务所产生的内容，不得违反国家相关法律制度，包含但不限于如下原则：
             <p>（1）反对宪法所确定的基本原则的； </p>
            <p>（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>
            <p>（3）损害国家荣誉和利益的； </p>
            <p>（4）煽动民族仇恨、民族歧视，破坏民族团结的；</p>
            <p>（5）破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
            <p>（6）散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
              <p>（7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>
            <p>（8）侮辱或者诽谤他人，侵害他人合法权益的；</p>
            <p>（9）含有法律、行政法规禁止的其他内容的。</p>
          </p>
          <p>
            4、用户不得利用“行龙乐器”账号或本服务制作、上载、复制、发布、传播下干扰“行龙乐器”正常运营，以及侵犯其他用户或第三方合法权益的内容：
            <p>（1）含有任何性或性暗示的；</p>
            <p>（2）含有辱骂、恐吓、威胁内容的；</p>
            <p>（3）含有骚扰、垃圾广告、恶意信息、诱骗信息的；</p>
            <p>（4）涉及他人隐私、个人信息或资料的；</p>
            <p>（5）侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的；</p>
            <p>（6）含有其他干扰本服务正常运营和侵犯其他用户或第三方合法权益内容的信息。</p>
          </p>
        </section>
        <section>
          <header>五、服务内容</header>
          <p>1、行龙乐器具体服务内容由行龙乐器根据实际情况提供，包括但不限于： 
             <p>（1）在线咨询服务；</p>
            <p>（2）服务商收入结算和用户支付费用：具体金额以行龙乐器产生的统计数据为准。 </p>
          </p>
          <p>
            2、行龙乐器有权随时审核或删除用户发布/传播的涉嫌违法或违反社会主义精神文明，或者被行龙乐器认为不妥当的内容（包括但不限于文字、语音、图片、视频、图文等）。
          </p>
          <p>
           3、所有发给用户的通告及其他消息都可通过网站或者用户所提供的联系方式发送。
          </p>
        </section>
         <section>
          <header>六、服务的终止</header>
          <p>1、在下列情况下，行龙乐器有权终止向用户提供服务： 
             <p>（1）在用户违反本服务协议相关规定时，行龙乐器有权终止向该用户提供服务。如该用户再一次直接或间接或以他人名义注册为用户的，一经发现，行龙乐器有权直接单方面终止向该用户提供服务； </p>
            <p>（2）如行龙乐器通过用户提供的信息与用户联系时，发现用户在注册时填写的联系方式已不存在或无法接通，行龙乐器以其它联系方式通知用户更改，而用户在三个工作日内仍未能提供新的联系方式，行龙乐器有权终止向该用户提供服务； </p>
            <p>（3）用户不得通过程序或人工方式进行刷量或作弊，若发现用户有作弊行为，行龙乐器将立即终止服务，并有权扣留账户内金额； </p>
            <p>（4）一旦行龙乐器发现用户提供的数据或信息中含有虚假内容，行龙乐器有权随时终止向该用户提供服务；</p>
            <p>（5）本服务条款终止或更新时，用户明示不愿接受新的服务条款；</p>
            <p>（6）其它行龙乐器认为需终止服务的情况。</p>
          </p>
          <p>
           2、服务终止后，行龙乐器没有义务为用户保留原账号中或与之相关的任何信息，或转发任何未曾阅读或发送的信息给用户或第三方。
          </p>
        </section>
      </div>
      <div class="footer">
        <a @click="close">确定</a>
      </div>
    </div>
  </div>
</template>
<script>
export default {
  name: 'protocal',
  props: {
    value: Boolean
  },
  data() {
    return {
      show: false
    }
  },
  watch: {
    value(val) {
      this.show = val
    },
    show(val) {
      this.$emit('input', val)
    }
  },
  methods: {
    close() {
      this.show = false
    }
  }
}
</script>
<style lang="scss">
.proto-dialog {
  background: #fff;
  width: 6.5rem;
  position: absolute;
  top: 50%;
  left: 50%;
  height: 50%;
  transform: translate3d(-50%, -50%, 0);
  border-radius: 10px;
  z-index: 1001;
  display: flex;
  flex-direction: column;
  .title {
    font-size: 0.3rem;
    color: #323136;
    line-height: 0.8rem;
    text-align: center;
  }
  .body {
    flex: 1;
    padding: 0 0.3rem 0.3rem;
    font-size: 0.24rem;
    color: #323136;
    overflow: auto;
    header {
      text-align: center;
    }
    p {
      text-indent: 2em;
      padding-bottom: 0.2rem;
    }
  }
  .footer {
    text-align: center;
    padding: 0.1rem 0;
    a {
      width: 1rem;
      display: inline-block;
      line-height: 0.5rem;
      font-size: 0.28rem;
      background-color: #bf3737;
      color: #fff;
      border-radius: 5px;
    }
  }
}
</style>


